Tekla Open API Reference for Tekla Structures 2025
OBB.SetExtent Method
Overload List
Name | Description
SetExtent(Double[])
 Sets the extents to the OBB.
SetExtent(Double, Double, Double)
 Sets the extents to the OBB.
Top
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace